tutorials/boxTurb16_createdCyclics/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
4096
(
(0.0224567 -0.0320444 -0.00623914)
(0.015342 -0.0200539 -0.00595171)
(0.00698039 -0.00825432 -0.00519617)
(-0.00135393 0.00155671 -0.00408746)
(-0.00838932 0.00788254 -0.00279432)
(-0.0130521 0.00975729 -0.00151362)
(-0.0146314 0.00689447 -0.00044034)
(-0.0128882 -0.000268729 0.000262044)
...
)
;

boundaryField
{
    patch0_half0
    {
        type            cyclic;
    }
    patch0_half1
    {
        type            cyclic;
    }
    patch1_half0
    {
        type            cyclic;
    }
    patch1_half1
    {
        type            cyclic;
    }
    patch2_half0
    {
        type            cyclic;
    }
    patch2_half1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
