tutorials/boxTurb16_createdCyclics/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    patch0_half0_set;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (-0.0001 0 0)(0.0001 1 1);
        }
    }

    {
        name    patch0_half1_set;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (0.9999 0 0)(1.0001 1 1);
        }
    }


    {
        name    patch1_half0_set;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (0 -0.0001 0)(1 0.0001 1);
        }
    }

    {
        name    patch1_half1_set;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (0 0.9999 0)(1 1.0001 1);
        }
    }


    {
        name    patch2_half0_set;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (0 0 -0.0001)(1 1 0.0001);
        }
    }

    {
        name    patch2_half1_set;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (0 0 0.9999)(1 1 1.0001);
        }
    }
);

// ************************************************************************* //
